       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYMAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY "copybooks/MISSING-RECORD.cpy".
       01 WS-STATUS PIC X(10).
       PROCEDURE DIVISION.
       MAIN-SECTION.
           DISPLAY "THIS SHOULD FAIL DUE TO MISSING COPYBOOK"
           MOVE 0 TO RETURN-CODE
           GOBACK.
