       01  CHN-RECORD.
           05  CHN-NUM-1       PIC 9(4) COMP VALUE ZERO.
           05  CHN-NUM-2       PIC 9(4) COMP VALUE ZERO.
           05  CHN-RESULT      PIC 9(6) COMP VALUE ZERO.
           05  CHN-MSG         PIC X(20) VALUE SPACES.
