       IDENTIFICATION DIVISION.
       PROGRAM-ID. CCMAIN01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RC PIC 9(02) VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-SECTION.
           DISPLAY "CLAIMSCORE ENTERPRISE NIGHTLY BATCH"
           CALL "CCLOAD01" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           CALL "CCPROC01" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           CALL "CCREPT01" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           DISPLAY "CLAIMSCORE NIGHTLY BATCH COMPLETED"
           MOVE 0 TO RETURN-CODE
           GOBACK.
