       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG3 EXECUTING - SUCCESS".
           MOVE 0 TO RETURN-CODE.
           STOP RUN.
