       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG2 EXECUTING - SETTING RC 8".
           MOVE 8 TO RETURN-CODE.
           STOP RUN.
