       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG1 EXECUTING - SETTING RC 4".
           MOVE 4 TO RETURN-CODE.
           STOP RUN.
