       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2JN01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SQLCA-VARIABLES.
           05  SQLCODE    PIC S9(9) COMP.
           05  SQLSTATE   PIC X(5).
       01  WS-RESULT.
           05  WS-CUST-NAME   PIC X(20) VALUE SPACES.
           05  WS-ORDER-DATE  PIC X(10) VALUE SPACES.
           05  WS-CUST-ID     PIC S9(9) COMP VALUE 101.
       PROCEDURE DIVISION.
      *> [PREPROCESSED: SQL stub]
      *> EXEC SQL
      *> SELECT C.CUST_NAME, O.ORDER_DATE
      *> INTO :WS-CUST-NAME, :WS-ORDER-DATE
      *> FROM CUSTOMER C INNER JOIN ORDERS O
      *> ON C.CUST_ID = O.CUSTOMER_ID
      *> WHERE C.CUST_ID = :WS-CUST-ID
      *> END-EXEC.
           CONTINUE.
           DISPLAY "SQLCODE: " SQLCODE
           DISPLAY "CUST: " WS-CUST-NAME
           DISPLAY "ORDER: " WS-ORDER-DATE
           GOBACK.
