       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2SEL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SQLCA-VARIABLES.
           05  SQLCODE    PIC S9(9).
           05  SQLSTATE   PIC X(5).
       01  WS-CUSTOMER.
           05  WS-CUST-ID   PIC S9(9) VALUE 101.
           05  WS-CUST-NAME PIC X(20) VALUE SPACES.
OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(049) VALUE "SELECT CUST_NAME FROM CUSTOMER"
OCESQL  &  " WHERE CUST_ID = $1".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       PROCEDURE DIVISION.
OCESQL*    EXEC SQL
OCESQL*        SELECT CUST_NAME
OCESQL*        INTO :WS-CUST-NAME
OCESQL*        FROM CUSTOMER
OCESQL*        WHERE CUST_ID = :WS-CUST-ID
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 20
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-CUST-NAME
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-CUST-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0001
OCESQL          BY VALUE 1
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.
           DISPLAY "SQLCODE: " SQLCODE
           DISPLAY "SQLSTATE: " SQLSTATE
           DISPLAY "CUST-NAME: " WS-CUST-NAME
           GOBACK.
