       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG1.
       
       DATA DIVISION.
       LINKAGE SECTION.
       COPY "CHNDATA.cpy".
       
       PROCEDURE DIVISION USING CHN-RECORD.
           ADD CHN-NUM-1 TO CHN-NUM-2 GIVING CHN-RESULT.
           MOVE "ADDITION DONE" TO CHN-MSG.
           GOBACK.
