       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG2 EXECUTING - RC 4".
           MOVE 4 TO RETURN-CODE.
           STOP RUN.
