       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG1 EXECUTING - RC 0".
           MOVE 0 TO RETURN-CODE.
           STOP RUN.
