       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBPROG4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY "COBPROG4 EXECUTING (ELSE BRANCH)".
           MOVE 0 TO RETURN-CODE.
           STOP RUN.
