//JCLBATCH01 JOB (ACCT),'SYSTEMA',CLASS=A
//SET1     SET INFILE='MY.INPUT.DATA'
//STEP1    EXEC PGM=COBPROG1
//INPUTDD  DD DSN=&INFILE,DISP=SHR
//OUTPUTDD DD DSN='MY.OUTPUT.DATA',DISP=(NEW,CATLG)
//SYSIN    DD *
SYSIN DATA LINE 1
/*
//*
//* Define a procedure
//MYPROC   PROC OUTFILE='MY.REPORT.DATA'
//PROCSTEP EXEC PGM=COBPROG2
//OUTPUTDD DD DSN='MY.OUTPUT.DATA',DISP=SHR
//REPORTDD DD DSN=&OUTFILE,DISP=(NEW,CATLG)
//         PEND
//*
//* Invoke the procedure
//STEP2    EXEC MYPROC,OUTFILE='MY.REPORT.DATA',COND=(0,NE,STEP1)
//*
//* A step that must be bypassed
//STEPBYPS EXEC PGM=COBPROG3,COND=(4,EQ,STEP2.PROCSTEP)
//*
//* Conditional routing via IF-THEN-ELSE
//         IF (STEP2.PROCSTEP.RC = 4) THEN
//STEP3    EXEC PGM=COBPROG3
//REPORTDD DD DSN='MY.REPORT.DATA',DISP=SHR
//FINALDD  DD DSN='MY.FINAL.DATA',DISP=(NEW,CATLG)
//         ENDIF
