       IDENTIFICATION DIVISION.
       PROGRAM-ID. REPORTWRITER01.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTFILE ASSIGN TO "output.txt".
           
       DATA DIVISION.
       FILE SECTION.
       FD  OUTFILE REPORT IS SAL-REPORT.
       01  OUT-REC   PIC X(80).
       
       WORKING-STORAGE SECTION.
       01  SALARY    PIC 9(5) VALUE 15000.
       
       REPORT SECTION.
       RD  SAL-REPORT.
       01  TYPE IS PAGE HEADING.
           05  LINE NUMBER IS 1.
               10  COLUMN NUMBER IS 1 PIC X(30) VALUE "DEPARTMENT SALARY REPORT".
       01  EMP-LINE TYPE IS DETAIL.
           05  LINE NUMBER IS PLUS 1.
               10  COLUMN NUMBER IS 5 PIC X(10) VALUE "SALARY:".
               10  COLUMN NUMBER IS 16 PIC ZZZZ9 SOURCE SALARY.
       01  TYPE IS PAGE FOOTING.
           05  LINE NUMBER IS PLUS 2.
               10  COLUMN NUMBER IS 1 PIC X(10) VALUE "PAGE:".
               10  COLUMN NUMBER IS 12 PIC Z9 SOURCE PAGE-COUNTER.
               
       PROCEDURE DIVISION.
       MAIN-PARA.
           OPEN OUTPUT OUTFILE.
           INITIATE SAL-REPORT.
           GENERATE EMP-LINE.
           MOVE 25000 TO SALARY.
           GENERATE EMP-LINE.
           TERMINATE SAL-REPORT.
           CLOSE OUTFILE.
           GOBACK.
