       01  CUSTOMER-RECORD.
           05  CUS-CUSTOMER-ID     PIC X(06).
           05  CUS-NAME            PIC X(30).
           05  CUS-STATUS          PIC X(01).
           05  CUS-CITY            PIC X(20).
           05  CUS-STATE           PIC X(02).
           05  CUS-RISK-LEVEL      PIC X(01).
           05  CUS-RESERVED        PIC X(20).
