       01  CLAIM-RECORD.
           05  CLM-ID              PIC X(12).
           05  CLM-DATE            PIC 9(8).
           05  CLM-TIME            PIC 9(6).
           05  CLM-POLICY-ID       PIC X(10).
           05  CLM-TYPE            PIC X(02).
           05  CLM-CHANNEL         PIC X(02).
           05  CLM-LOSS-AMOUNT     PIC 9(9)V99.
           05  CLM-DESCRIPTION     PIC X(40).
           05  CLM-REPORTED-BY     PIC X(20).
           05  CLM-RESERVED        PIC X(10).
