       01  POLICY-RECORD.
           05  POL-POLICY-ID       PIC X(10).
           05  POL-CUSTOMER-ID     PIC X(06).
           05  POL-TYPE            PIC X(02).
           05  POL-STATUS          PIC X(01).
           05  POL-CURRENCY        PIC X(03).
           05  POL-COVER-LIMIT     PIC S9(11)V99 COMP-3.
           05  POL-DEDUCTIBLE      PIC S9(9)V99 COMP-3.
           05  POL-EFFECTIVE-DATE  PIC 9(8).
           05  POL-EXPIRY-DATE     PIC 9(8).
           05  POL-RESERVED        PIC X(20).
