       01 LNK-CALC-AREA.
          05 LNK-BALANCE      PIC 9(10)V99.
          05 LNK-TX-TYPE      PIC X(1).
          05 LNK-TX-AMOUNT    PIC 9(10)V99.
          05 LNK-NEW-BALANCE  PIC S9(10)V99.
