       IDENTIFICATION DIVISION.
       PROGRAM-ID. LINKPROG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  DFHCOMMAREA                 PIC X(10) VALUE "UPDATEDVAL".
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY "LINKPROG CALLED"
           GOBACK.
