       01 SALES-RECORD.
          05 SLS-REP-ID   PIC X(8).
          05 SLS-REGION   PIC X(5).
          05 SLS-PRODUCT  PIC X(12).
          05 SLS-QTY      PIC 9(5).
          05 SLS-UNIT-PRICE PIC 9(7)V99.
