       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYBAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CODE PIC X(04).
       PROCEDURE DIVISION.
       MAIN-SECTION.
           MOVE "FAIL" TO WS-CODE
           INTENTIONAL SYNTAX ERROR HERE DELIBERATE
           DISPLAY WS-CODE
           GOBACK.
