       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2SEL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
OCESQL*    EXEC SQL INCLUDE SQLCA END-EXEC.
OCESQL     copy "sqlca.cbl".
       01  DB-NAME PIC X(50)
           VALUE 'modernization_db@host.docker.internal'.
       01  DB-USER PIC X(10) VALUE 'modernize'.
       01  DB-PASS PIC X(10) VALUE 'modernize'.
       01  WS-CUSTOMER.
           05  WS-CUST-ID   PIC S9(9) VALUE 101.
           05  WS-CUST-NAME PIC X(20) VALUE SPACES.
OCESQL*
OCESQL 01  SQ0001.
OCESQL     02  FILLER PIC X(049) VALUE "SELECT CUST_NAME FROM CUSTOMER"
OCESQL  &  " WHERE CUST_ID = $1".
OCESQL     02  FILLER PIC X(1) VALUE X"00".
OCESQL*
       PROCEDURE DIVISION.
OCESQL*    EXEC SQL
OCESQL*        CONNECT :DB-USER IDENTIFIED BY :DB-PASS USING :DB-NAME
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLConnect" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE DB-USER
OCESQL          BY VALUE 10
OCESQL          BY REFERENCE DB-PASS
OCESQL          BY VALUE 10
OCESQL          BY REFERENCE DB-NAME
OCESQL          BY VALUE 50
OCESQL     END-CALL.
OCESQL*    EXEC SQL
OCESQL*        SELECT CUST_NAME
OCESQL*        INTO :WS-CUST-NAME
OCESQL*        FROM CUSTOMER
OCESQL*        WHERE CUST_ID = :WS-CUST-ID
OCESQL*    END-EXEC.
OCESQL     CALL "OCESQLStartSQL"
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetResultParams" USING
OCESQL          BY VALUE 16
OCESQL          BY VALUE 20
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-CUST-NAME
OCESQL     END-CALL
OCESQL     CALL "OCESQLSetSQLParams" USING
OCESQL          BY VALUE 3
OCESQL          BY VALUE 9
OCESQL          BY VALUE 0
OCESQL          BY REFERENCE WS-CUST-ID
OCESQL     END-CALL
OCESQL     CALL "OCESQLExecSelectIntoOne" USING
OCESQL          BY REFERENCE SQLCA
OCESQL          BY REFERENCE SQ0001
OCESQL          BY VALUE 1
OCESQL          BY VALUE 1
OCESQL     END-CALL
OCESQL     CALL "OCESQLEndSQL"
OCESQL     END-CALL.
           DISPLAY "SQLCODE: " SQLCODE
           DISPLAY "SQLSTATE: " SQLSTATE
           DISPLAY "CUST-NAME: " WS-CUST-NAME
           GOBACK.
