       IDENTIFICATION DIVISION.
       PROGRAM-ID. SUBPROG2.
       
       DATA DIVISION.
       LINKAGE SECTION.
       COPY "CHNDATA.cpy".
       
       PROCEDURE DIVISION USING CHN-RECORD.
           MULTIPLY CHN-NUM-1 BY CHN-NUM-2 GIVING CHN-RESULT.
           MOVE "MULTIPLY DONE" TO CHN-MSG.
           GOBACK.
