//JCLSYMBOL01 JOB (ACCT),'SYMBOL_TEST',CLASS=A
//SET1     SET INFILE='MY.INPUT.DATA'
//STEP1    EXEC PGM=COBPROG1
//INPUTDD  DD DSN=&INFILE,DISP=SHR
//OUTPUTDD DD DSN='MY.OUTPUT.DATA',DISP=(NEW,CATLG)
//*
//MYPROC   PROC OUTFILE='MY.REPORT.DATA',TEMPNAME='&&MYTEMP'
//PROCSTEP EXEC PGM=COBPROG1
//INPUTDD  DD DSN=&TEMPNAME,DISP=SHR
//OUTPUTDD DD DSN=&OUTFILE,DISP=(NEW,CATLG)
//         PEND
//*
//STEP2    EXEC MYPROC,OUTFILE='MY.OVERRIDDEN.DATA',TEMPNAME='&&MYTEMP'
