       01 SRC-RECORD.
          05 SRC-ACCOUNT-ID   PIC X(12).
          05 SRC-BALANCE      PIC 9(10)V99.
          05 SRC-TX-TYPE      PIC X(1).
          05 SRC-TX-AMOUNT    PIC 9(10)V99.
