       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2DEL01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SQLCA-VARIABLES.
           05  SQLCODE    PIC S9(9) COMP.
           05  SQLSTATE   PIC X(5).
       01  WS-CUSTOMER.
           05  WS-CUST-ID   PIC S9(9) COMP VALUE 101.
       PROCEDURE DIVISION.
           EXEC SQL
               DELETE FROM CUSTOMER
               WHERE CUST_ID = :WS-CUST-ID
           END-EXEC.
           DISPLAY "SQLCODE: " SQLCODE
           DISPLAY "SQLSTATE: " SQLSTATE
           GOBACK.
