       IDENTIFICATION DIVISION.
       PROGRAM-ID. DB2TX01.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SQLCA-VARIABLES.
           05  SQLCODE    PIC S9(9) COMP.
           05  SQLSTATE   PIC X(5).
       PROCEDURE DIVISION.
           EXEC SQL COMMIT END-EXEC.
           DISPLAY "COMMIT SQLCODE: " SQLCODE
           EXEC SQL ROLLBACK END-EXEC.
           DISPLAY "ROLLBACK SQLCODE: " SQLCODE
           GOBACK.
