       IDENTIFICATION DIVISION.
       PROGRAM-ID. PAYMAIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-RC PIC 9(02) VALUE ZERO.
       PROCEDURE DIVISION.
       MAIN-SECTION.
           DISPLAY "PAYCHAIN BATCH STARTED"
           CALL "PAYLOAD" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           CALL "PAYPROC" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           CALL "PAYREPT" RETURNING WS-RC
           IF WS-RC NOT = 0 MOVE 12 TO RETURN-CODE GOBACK END-IF
           DISPLAY "PAYCHAIN BATCH COMPLETED"
           MOVE 0 TO RETURN-CODE
           GOBACK.
